Script started on 2020-05-13 23:46:03+0900
]0;jaeho@jaeho-VirtualBox: ~/gdb_hw[01;32mjaeho@jaeho-VirtualBox[00m:[01;34m~/gdb_hw[00m$ PS1="\d\t\u $"
수  5월 1323:46:22jaeho $ls
gdb_hw1.c  gdb_hw2.c  gdb_hw3.c  gdb_hw4.c  gdb_hw5.c  gdb_hw6.c  log.txt
수  5월 1323:46:31jaeho $gcc -g -o hw1 gdb_hw1.c
[01m[Kgdb_hw1.c:[m[K In function ‘[01m[Kmain[m[K’:
[01m[Kgdb_hw1.c:20:3:[m[K [01;35m[Kwarning: [m[Kimplicit declaration of function ‘[01m[Ksleep[m[K’ [[01;35m[K-Wimplicit-function-declaration[m[K]
   [01;35m[Ksleep[m[K(1);
   [01;35m[K^~~~~[m[K
수  5월 1323:47:16jaeho $vim [K[K[K[Kvim gdb_hw1.c
[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;28r[?12h[?12l[27m[23m[29m[m[H[2J[?25l[28;1H[97m[41mE325: 주목[m
Found a swap file by the name ".gdb_hw1.c.swp"
[10C소유자: jaeho   날짜: Tue May 12 18:06:22 2020
[9C파일 이름: ~jaeho/gdb_hw/gdb_hw1.c
[10C수정: 아니오
[9C사용자 이름: jaeho  호스트 이름: jaeho-VirtualBox
[8C프로세스 ID: 26195
While opening file "gdb_hw1.c"
[13C날짜: Mon Apr 27 22:34:10 2020

(1) 다른 프로그램이 같은 파일을 고치고 있는중일 수 있습니다.
    만약 그렇다면 같은 파일을 두 개의 프로그램에서 고치지 않도록
    조심하시기 바랍니다. 종료하세요. 계속하시려면 주의하세요.
(2) 이 파일을 고치다가 죽었었습니다.
    만약 그렇다면 ":recover" 혹은 "vim -r gdb_hw1.c"
    을 사용하여 복구하십시오 (":help recovery" 참고).
    이미 복구하셨었다면 스왑파일 ".gdb_hw1.c.swp"
    을(를) 지우셔야 이 메시지가 사라집니다.

[32m스왑 파일 ".gdb_hw1.c.swp"이 이미 존재합니다![m
[32m읽기 전용으로 열기([O]), 무조건 편집((E)), 복구((R)), 삭제((D)), 끝내기((Q)), [m
[27;79H[94m>[m[28;1H[32m버리기((A)): [?25h[m[28;1H[K[?25l[28;1H"gdb_hw1.c" [noeol][도스] 33L, 516C[2;1H▽[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[34m//진행 상황을 %로 계산해서 출력하는 코드입니다.
//%가 정상적으로 출력되지 않는 코드입니다.[m

[35m#include [m[31m<stdio.h>[m
[35m#define MAX [m[31m1024[m

[32mint[m eval([32mint[m cur);[8;1H[K[9;1H[32mint[m main()[9;11H[K[10;1H{[10;10H[K[11;5H[32mint[m cnt = [31m0[m;[11;17H[K[12;5H[32mint[m pcnt = [31m0[m; [12;19H[K[13;9H[K[14;1H        [38;5;130mwhile[m (cnt <= MAX)[14;27H[K[15;9H{[15;14H[K[16;17Hpcnt = eval(cnt);
                printf([31m"[m[35m%d[m[31m:[m[35m%d[m[31m | [m[35m%d%%\n[m[31m"[m, cnt, MAX, pcnt);[17;58H[K[18;5H            fflush([31mstdout[m); [18;34H[K[19;5H            cnt += [31m30[m; [19;28H[K[20;1H                sleep([31m1[m);[20;26H[K[21;5H    }[21;10H[K[22;5H    [38;5;130mreturn[m [31m0[m; [22;19H[K[23;1H}[23;5H[K[24;5H[K[25;1H[32mint[m eval([32mint[m cur)
{[32m [m[26;2H[K[27;1H        [32mint[m per = [31m0[m;[27;21H[K[28;62H1,1[8C꼭대기[1;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[27m[23m[29m[m[H[2J[?25l[1;1H[96m//진행 상황을 %로 계산해서 출력하는 코드입니다.
//%가 정상적으로 출력되지 않는 코드입니다.[m

[38;5;81m#include [m[95m<stdio.h>[m
[38;5;81m#define MAX [m[95m1024[m

[38;5;121mint[m eval([38;5;121mint[m cur);

[38;5;121mint[m main()
{
    [38;5;121mint[m cnt = [95m0[m;
    [38;5;121mint[m pcnt = [95m0[m;[14;9H[93mwhile[m (cnt <= MAX)[15;9H{[16;17Hpcnt = eval(cnt);[17;17Hprintf([95m"[m[38;5;224m%d[m[95m:[m[38;5;224m%d[m[95m | [m[38;5;224m%d%%\n[m[95m"[m, cnt, MAX, pcnt);[18;17Hfflush([95mstdout[m);[19;17Hcnt += [95m30[m;[20;17Hsleep([95m1[m);[21;9H}[22;9H[93mreturn[m [95m0[m;
}

[38;5;121mint[m eval([38;5;121mint[m cur)
{[27;9H[38;5;121mint[m per = [95m0[m;[28;62H1,1[8C꼭대기"gdb_hw1.c" [noeol][도스] 33L, 516C[1;1H[?25h[?25l[28;52H~@k[1;1H[28;52H   [2;1H[28;62H2[2;1H[?25h[?25l[28;52H~@k[2;1H[28;52H   [3;1H[28;62H3,0-1[3;1H[?25h[?25l[28;52H~@k[3;1H[28;52H   [4;1H[28;62H4,1  [4;1H[?25h[?25l[28;52H~@@[4;1H[28;52H   [4;18H[28;65H8[4;18H[?25h[?25l[28;52H^M[4;18H[28;52H  [5;1H[28;62H5,1 [5;1H[?25h[?25l[28;52H~@k[5;1H[28;52H   [5;1H[28;1H[1m-- 끼워넣기 --[m[28;15H[K[28;62H5,1[8C꼭대기[5;1H[?25h[?25l[28;62H4[4;1H[?25h[?25l[28;65H9[4;19H[?25h[?25l[5;27r[5;1H[L[1;28r[28;62H[K[28;62H5,1[8C꼭대기[5;1H[?25h[?25l#[28;64H2[5;2H[?25h[?25li[28;64H3[5;3H[?25h[?25ln[28;64H4[5;4H[?25h[?25lc[28;64H5[5;5H[?25h[?25ll[28;64H6[5;6H[?25h[?25lu[28;64H7[5;7H[?25h[?25ld[28;64H8[5;8H[?25h[?25le[28;64H9[5;9H[?25h[?25l[28;64H10[5;10H[?25h[?25l[38;5;81m#include <[m[28;65H1[5;11H[?25h[?25lu[28;65H2[5;12H[?25h[?25ln[28;65H3[5;13H[?25h[?25li[28;65H4[5;14H[?25h[?25ls[28;65H5[5;15H[?25h[?25l[5;14H[K[28;65H4[5;14H[?25h[?25lt[28;65H5[5;15H[?25h[?25l[5;14H[K[28;65H4[5;14H[?25h[?25ls[28;65H5[5;15H[?25h[?25lt[28;65H6[5;16H[?25h[?25ld[28;65H7[5;17H[?25h[?25l.[28;65H8[5;18H[?25h[?25lh[28;65H9[5;19H[?25h[?25l[5;10H[95m<unistd.h>[m[28;64H20[5;20H[?25h[?25l:[28;65H1[5;21H[?25h[?25l[5;20H[K[28;65H0[5;20H[?25h[?25l[28;4H[1m바꾸기기 --[m[28;13H[K[28;62H5,20[7C꼭대기[5;20H[?25h[?25l:[28;65H1[5;21H[?25h[?25l[5;20H[K[28;65H0[5;20H[?25h[?25l[28;62H6,17[6;17H[?25h[?25l[28;62H7,1 [7;1H[?25h[?25l[28;62H8,19[8;19H[?25h[?25l[28;62H9,1 [9;1H[?25h[?25l[10;9H[46m()[m[28;62H10,11[10;11H[?25h[?25l()
[46m{[24;1H}[m[28;63H1,2 [11;2H[?25h[?25l{[24;1H}[28;63H2,17[12;17H[?25h[?25l[28;63H3,18[13;18H[?25h[?25l[28;63H4,1 [14;1H[?25h[?25l[28;63H5,13-20[15;20H[?25h[?25l[16;9H[46m{[22;9H}[m[28;63H6,3-10 [16;10H[?25h[?25l{[22;9H}[28;63H7,6-2[17;20H[?25h[?25l[28;63H8[18;20H[?25h[?25l[28;63H9[19;20H[?25h[?25l[28;62H20[20;20H[?25h[?25l[28;63H1[21;20H[?25h[?25l[16;9H[46m{[22;9H}[m[28;63H2,3-1[22;10H[?25h[?25l[1;27r[27;1H
[1;28r[27;9H[38;5;121mint[m per = [95m0[m;[28;62H[K[28;62H23,11-18      14%[15;9H{[21;9H}[22;18H[?25h[?25l[1;27r[27;1H
[1;28r[28;62H[K[28;62H24,2[10C28%[9;1H[46m{[22;1H}[?25h[?25l[1;27r[m[27;1H
[1;28r[27;9Hprintf([95m"[m[38;5;224m%d[m[95m ... [m[38;5;224m\n[m[95m"[m, cur);[28;62H[K[28;62H25,1[10C42%[8;1H{[21;1H}
[?25h[?25l[1;27r[27;1H
[1;28r[27;9Hper = cur / MAX * [95m100[m;[28;62H[K[28;62H26,18[9C57%[22;9H[46m([7C)[?25h[?25l[1;27r[m[27;1H
[1;28r[28;62H[K[28;62H27,2[10C71%[21;9H([7C)
{[?25h[?25l[1;27r[27;1H
[1;28r[27;9H[93mreturn[m per;[28;62H[K[28;62H28,13-20      85%[22;20H[?25h[?25l[1;27r[27;1H
[1;28r[27;1H}[28;62H[K[28;62H29,2-9[7C바닥[22;9H[?25h[?25l[28;62H30,13-20[23;20H[?25h[?25l[28;63H1[24;20H[?25h[?25l[28;63H2,2-9  [25;9H[?25h[?25l[28;63H3,13-20[26;20H[?25h[28;1H[K[26;19H[?25l[28;52H^[[26;19H[28;52H  [26;20H[28;62H33,12-19     바닥[26;19H[?25h[?25l[28;52H~@k[26;19H[28;52H   [27;1H[20;1H[46m{[27;1H}[m[28;63H4,1    [27;1H[?25h[?25l[28;52H~@k[27;1H[28;52H   [27;1H[?25h[?25l[28;52H:[27;1H[28;52H[K[28;1H:[?2004h[?25h [?25l[27;1H[28;62H34,1[9C바닥[27;1H[?25h[?25l[28;52H^[[27;1H[28;52H  [27;1H[28;52H^[[27;1H[28;52H  [27;1H[?25h[?25l[28;52H^[[27;1H[28;52H  [27;1H[28;52H^[[27;1H[28;52H  [27;1H[?25h[?25l[28;52H^[[27;1H[28;52H  [27;1H[28;52H^[[27;1H[28;52H  [27;1H[?25h[?25l[28;52H^[[27;1H[28;52H  [27;1H[28;52H^[[27;1H[28;52H  [27;1H[?25h[?25l[28;52H:[27;1H[28;52H[K[28;1H:[?2004h[?25hw[?25l[?25hq[?25l[?25h[?25l[?2004l"gdb_hw1.c" [도스] 34L, 539C 저장 했습니다
[?2004l[?1l>[?25h[?1049l[23;0;0t수  5월 1323:49:50jaeho $vim gdb_hw1.c[10@gcc -g -o hw1[C[C[C[C[C[C[C[C[C[C
수  5월 1323:51:09jaeho $gdb hw1
GNU gdb (Ubuntu 8.1-0ubuntu3.2) 8.1.0.20180409-git
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hw1...done.
(gdb) r
Starting program: /home/jaeho/gdb_hw/hw1 
0 ... 
0:1024 | 0%
30 ... 
30:1024 | 0%
60 ... 
60:1024 | 0%
90 ... 
90:1024 | 0%
120 ... 
120:1024 | 0%
150 ... 
150:1024 | 0%
180 ... 
180:1024 | 0%
210 ... 
210:1024 | 0%
240 ... 
240:1024 | 0%
270 ... 
270:1024 | 0%
300 ... 
300:1024 | 0%
330 ... 
330:1024 | 0%
360 ... 
360:1024 | 0%
390 ... 
390:1024 | 0%
420 ... 
420:1024 | 0%
450 ... 
450:1024 | 0%
480 ... 
480:1024 | 0%
510 ... 
510:1024 | 0%
540 ... 
540:1024 | 0%
570 ... 
570:1024 | 0%
600 ... 
600:1024 | 0%
630 ... 
630:1024 | 0%
660 ... 
660:1024 | 0%
690 ... 
690:1024 | 0%
720 ... 
720:1024 | 0%
750 ... 
750:1024 | 0%
780 ... 
780:1024 | 0%
810 ... 
810:1024 | 0%
840 ... 
840:1024 | 0%
870 ... 
870:1024 | 0%
900 ... 
900:1024 | 0%
930 ... 
930:1024 | 0%
960 ... 
960:1024 | 0%
990 ... 
990:1024 | 0%
1020 ... 
1020:1024 | 0%
[Inferior 1 (process 7149) exited normally]
(gdb) b 17
Breakpoint 1 at 0x555555554732: file gdb_hw1.c, line 17.
(gdb) r
Starting program: /home/jaeho/gdb_hw/hw1 

Breakpoint 1, main () at gdb_hw1.c:17
17			pcnt = eval(cnt);
(gdb) b 31
Breakpoint 2 at 0x5555555547b4: file gdb_hw1.c, line 31.
(gdb) b [K[Kr
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /home/jaeho/gdb_hw/hw1 

Breakpoint 1, main () at gdb_hw1.c:17
17			pcnt = eval(cnt);
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /home/jaeho/gdb_hw/hw1 

Breakpoint 1, main () at gdb_hw1.c:17
17			pcnt = eval(cnt);
(gdb) b[Kinfo b
Num     Type           Disp Enb Address            What
1       breakpoint     keep y   0x0000555555554732 in main at gdb_hw1.c:17
	breakpoint already hit 1 time
2       breakpoint     keep y   0x00005555555547b4 in eval at gdb_hw1.c:31
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /home/jaeho/gdb_hw/hw1 

Breakpoint 1, main () at gdb_hw1.c:17
17			pcnt = eval(cnt);
(gdb) s
eval (cur=0) at gdb_hw1.c:28
28		int per = 0;
(gdb) c
Continuing.
0 ... 

Breakpoint 2, eval (cur=0) at gdb_hw1.c:31
31		per = cur / MAX * 100;
(gdb) c
Continuing.
0:1024 | 0%

Breakpoint 1, main () at gdb_hw1.c:17
17			pcnt = eval(cnt);
(gdb) c
Continuing.
30 ... 

Breakpoint 2, eval (cur=30) at gdb_hw1.c:31
31		per = cur / MAX * 100;
(gdb) c
Continuing.
30:1024 | 0%

Breakpoint 1, main () at gdb_hw1.c:17
17			pcnt = eval(cnt);
(gdb) c
Continuing.
60 ... 

Breakpoint 2, eval (cur=60) at gdb_hw1.c:31
31		per = cur / MAX * 100;
(gdb) c
Continuing.
60:1024 | 0%
c
Breakpoint 1, main () at gdb_hw1.c:17
17			pcnt = eval(cnt);
(gdb) c[Kc
Continuing.
90 ... 

Breakpoint 2, eval (cur=90) at gdb_hw1.c:31
31		per = cur / MAX * 100;
(gdb) c
Continuing.
90:1024 | 0%
c
Breakpoint 1, main () at gdb_hw1.c:17
17			pcnt = eval(cnt);
(gdb) c[Kc
Continuing.
120 ... 

Breakpoint 2, eval (cur=120) at gdb_hw1.c:31
31		per = cur / MAX * 100;
(gdb) c
Continuing.
120:1024 | 0%

Breakpoint 1, main () at gdb_hw1.c:17
17			pcnt = eval(cnt);
(gdb) c
Continuing.
150 ... 

Breakpoint 2, eval (cur=150) at gdb_hw1.c:31
31		per = cur / MAX * 100;
(gdb) c
Continuing.
150:1024 | 0%

Breakpoint 1, main () at gdb_hw1.c:17
17			pcnt = eval(cnt);
(gdb) info b
Num     Type           Disp Enb Address            What
1       breakpoint     keep y   0x0000555555554732 in main at gdb_hw1.c:17
	breakpoint already hit 7 times
2       breakpoint     keep y   0x00005555555547b4 in eval at gdb_hw1.c:31
	breakpoint already hit 6 times
(gdb) b[Kb 30
Breakpoint 3 at 0x55555555479e: file gdb_hw1.c, line 30.
(gdb) c[Ks
eval (cur=180) at gdb_hw1.c:28
28		int per = 0;
(gdb) c
Continuing.

Breakpoint 3, eval (cur=180) at gdb_hw1.c:30
30		printf("%d ... \n", cur);
(gdb) c
Continuing.
180 ... 

Breakpoint 2, eval (cur=180) at gdb_hw1.c:31
31		per = cur / MAX * 100;
(gdb) c
Continuing.
180:1024 | 0%

Breakpoint 1, main () at gdb_hw1.c:17
17			pcnt = eval(cnt);
(gdb) c
Continuing.

Breakpoint 3, eval (cur=210) at gdb_hw1.c:30
30		printf("%d ... \n", cur);
(gdb) b [K[Kinf0 locals
Undefined command: "inf0".  Try "help".
(gdb) ls
Undefined command: "ls".  Try "help".
(gdb) c
Continuing.
210 ... 

Breakpoint 2, eval (cur=210) at gdb_hw1.c:31
31		per = cur / MAX * 100;
(gdb) c
Continuing.
210:1024 | 0%
c

Breakpoint 1, main () at gdb_hw1.c:17
17			pcnt = eval(cnt);
(gdb) c
Continuing.

Breakpoint 3, eval (cur=240) at gdb_hw1.c:30
30		printf("%d ... \n", cur);
(gdb) c
Continuing.
240 ... 

Breakpoint 2, eval (cur=240) at gdb_hw1.c:31
31		per = cur / MAX * 100;
(gdb) info locals
per = 0
(gdb) l[Kk
Kill the program being debugged? (y or n) y
(gdb) ls
Undefined command: "ls".  Try "help".
(gdb) k
The program is not being run.
(gdb) n[Kn
The program is not being run.
(gdb) qyut[K[K[K[Kquit[K[K[K[Kexit[K[K[K[Kexit
Undefined command: "exit".  Try "help".
(gdb) quit
금  5월 1510:06:32jaeho $vim[K[K[Kvim [K[K[K[Kls
gdb_hw1.c  gdb_hw2.c  gdb_hw3.c  gdb_hw4.c  gdb_hw5.c  gdb_hw6.c  [0m[01;32mhw1[0m  log.txt
금  5월 1510:06:54jaeho $vim gdb_hw1.c
[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;28r[?12h[?12l[27m[23m[29m[m[H[2J[?25l[28;1H[97m[41mE325: 주목[m
Found a swap file by the name ".gdb_hw1.c.swp"
[10C소유자: jaeho   날짜: Tue May 12 18:06:22 2020
[9C파일 이름: ~jaeho/gdb_hw/gdb_hw1.c
[10C수정: 아니오
[9C사용자 이름: jaeho  호스트 이름: jaeho-VirtualBox
[8C프로세스 ID: 26195
While opening file "gdb_hw1.c"
[13C날짜: Wed May 13 23:49:50 2020
      NEWER than swap file!

(1) 다른 프로그램이 같은 파일을 고치고 있는중일 수 있습니다.
    만약 그렇다면 같은 파일을 두 개의 프로그램에서 고치지 않도록
    조심하시기 바랍니다. 종료하세요. 계속하시려면 주의하세요.
(2) 이 파일을 고치다가 죽었었습니다.
    만약 그렇다면 ":recover" 혹은 "vim -r gdb_hw1.c"
    을 사용하여 복구하십시오 (":help recovery" 참고).
    이미 복구하셨었다면 스왑파일 ".gdb_hw1.c.swp"
    을(를) 지우셔야 이 메시지가 사라집니다.

[32m스왑 파일 ".gdb_hw1.c.swp"이 이미 존재합니다![m
[32m읽기 전용으로 열기([O]), 무조건 편집((E)), 복구((R)), 삭제((D)), 끝내기((Q)), [m
[27;79H[94m>[m[28;1H[32m버리기((A)): [?25h[m[28;1H[K[?25l[28;1H"gdb_hw1.c" [도스] 34L, 539C[2;1H▽[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[32mint[m eval([32mint[m cur);

[32mint[m main()
{
    [32mint[m cnt = [31m0[m;
    [32mint[m pcnt = [31m0[m;[7;1H[K[8;9H[38;5;130mwhile[m (cnt <= MAX)[8;27H[K[9;9H{[9;10H[K[10;11H      pcnt = eval(cnt);[11;10H       printf([31m"[m[35m%d[m[31m:[m[35m%d[m[31m | [m[35m%d%%\n[m[31m"[m, cnt, MAX, pcnt);[11;58H[K[12;9H        fflush([31mstdout[m);
                cnt += [31m30[m;[13;27H[K[14;14H   sleep([31m1[m);[14;26H[K[15;7H  }[15;10H[K[16;9H[38;5;130mreturn[m [31m0[m;
}[17;2H[K[18;5H[K[19;1H[32mint[m eval([32mint[m cur)[19;18H[K[20;1H[106m{[m[20;2H[K[21;5H    [32mint[m per = [31m0[m;[21;21H[K[22;5H     [22;10H[K[23;5H    printf([31m"[m[35m%d[m[31m ... [m[35m\n[m[31m"[m, cur);[23;34H[K[24;5H    per = cur / MAX * [31m100[m; [24;33H[K[26;1H        [38;5;130mreturn[m per;[26;20H[K[27;1H[106m}[m[32m [m[27;2H[K[28;62H34,1[9C바닥[27;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;121mint[m eval([38;5;121mint[m cur);

[38;5;121mint[m main()
{
    [38;5;121mint[m cnt = [95m0[m;
    [38;5;121mint[m pcnt = [95m0[m;[8;9H[93mwhile[m (cnt <= MAX)[9;9H{[10;17Hpcnt = eval(cnt);[11;17Hprintf([95m"[m[38;5;224m%d[m[95m:[m[38;5;224m%d[m[95m | [m[38;5;224m%d%%\n[m[95m"[m, cnt, MAX, pcnt);[12;17Hfflush([95mstdout[m);[13;17Hcnt += [95m30[m;[14;17Hsleep([95m1[m);[15;9H}[16;9H[93mreturn[m [95m0[m;
}

[38;5;121mint[m eval([38;5;121mint[m cur)
[46m{[m[21;9H[38;5;121mint[m per = [95m0[m;[23;9Hprintf([95m"[m[38;5;224m%d[m[95m ... [m[38;5;224m\n[m[95m"[m, cur);[24;9Hper = cur / MAX * [95m100[m;[26;9H[93mreturn[m per;
[46m}[m[28;62H34,1[9C바닥"gdb_hw1.c" [도스] 34L, 539C[27;1H[?25h[?25l[20;1H{[27;1H}[28;63H3,1-8[26;8H[?25h[?25l[28;63H2[25;8H[?25h[?25l[28;52H~@k[25;8H[28;52H   [24;8H[28;63H1[24;8H[?25h[?25l[28;52H~@k[24;8H[28;52H   [23;8H[28;63H0[23;8H[?25h[?25l[28;52H~@k[23;8H[28;52H   [22;8H[28;62H29[22;8H[?25h[?25l[28;52H~@k[22;8H[28;52H   [21;8H[28;63H8[21;8H[?25h[?25l[28;52H~@k[21;8H[28;52H   [20;1H[46m{[27;1H}[m[28;63H7,1  [20;1H[?25h[?25l[28;52H~@k[20;1H[28;52H   [19;8H
{[27;1H}[28;63H6,8[19;8H[?25h[?25l[28;52H~@k[19;8H[28;52H   [18;1H[28;63H5,0-1[18;1H[?25h[?25l[28;52H~@k[18;1H[28;52H   [17;1H[4;1H[46m{[17;1H}[m[28;63H4,1  [17;1H[?25h[?25l[28;52H~@k[17;1H[28;52H   [16;8H[4;1H{[17;1H}[28;63H3,1-8[16;8H[?25h[?25l[28;52H~@k[16;8H[28;52H   [15;8H[28;63H2[15;8H[?25h[?25l[28;52H~@k[15;8H[28;52H   [14;8H[28;63H1[14;8H[?25h[?25l[28;52H~@k[14;8H[28;52H   [13;8H[28;63H0[13;8H[?25h[?25l[28;52H~@k[13;8H[28;52H   [12;8H[28;62H19[12;8H[?25h[?25l[28;52H~@k[12;8H[28;52H   [11;8H[28;63H8[11;8H[?25h[?25l[28;52H~@k[11;8H[28;52H   [10;8H[28;63H7[10;8H[?25h[?25l[28;52H~@k[10;8H[28;52H   [9;8H[28;63H6[9;8H[?25h[?25l[28;52H~@k[9;8H[28;52H   [8;8H[28;63H5[8;8H[?25h[?25l[28;52H~@k[8;8H[28;52H   [7;1H[28;63H4,0-1[7;1H[?25h[?25l[28;52H~@k[7;1H[28;52H   [6;8H[28;63H3,8  [6;8H[?25h[?25l[28;52H~@k[6;8H[28;52H   [6;8H[1;27r[1;1H[L[1;28r[28;1H[K[28;62H12,8[10C85%[6;8H[?25h[?25l[28;52H~@k[6;8H[28;52H   [6;1H[1;27r[1;1H[L[1;28r[1;1H[38;5;81m#define MAX [m[95m1024[m[6;1H[46m{[19;1H}[m[28;62H[K[28;62H11,1[10C71%[6;1H[?25h[?25l[28;52H~@k[6;1H[28;52H   [6;8H[1;27r[1;1H[L[1;28r[1;1H[38;5;81m#include [m[95m<unistd.h>[m[7;1H{[20;1H}[28;62H[K[28;62H10,8[10C57%[6;8H[?25h[?25l[28;52H~@k[6;8H[28;52H   [6;1H[1;27r[1;1H[L[1;28r[1;1H[38;5;81m#include [m[95m<stdio.h>[m[28;62H[K[28;62H9,0-1[9C42%[6;1H[?25h[?25l[28;52H~@k[6;1H[28;52H   [6;8H[1;27r[1;1H[L[1;28r[28;62H[K[28;62H8,8[11C28%[6;8H[?25h[?25l[28;52H~@k[6;8H[28;52H   [6;1H[1;27r[1;1H[L[1;28r[1;1H[96m//%가 정상적으로 출력되지 않는 코드입니다.[m[28;62H[K[28;62H7,0-1[9C14%[6;1H[?25h[?25l[28;52H~@k[6;1H[28;52H   [6;8H[1;27r[1;1H[L[1;28r[1;1H[96m//진행 상황을 %로 계산해서 출력하는 코드입니다.[m[28;62H[K[28;62H6,8[8C꼭대기[6;8H[?25h[?25l[28;52H~@k[6;8H[28;52H   [5;8H[28;62H5[5;8H[?25h[?25l[28;52H~@k[5;8H[28;52H   [4;8H[28;62H4[4;8H[?25h[?25l[28;52H~@k[4;8H[28;52H   [3;1H[28;62H3,0-1[3;1H[?25h[?25l[28;52H~@k[3;1H[28;52H   [2;7H[28;62H2,8-7[2;7H[?25h[?25l[28;52H~@k[2;7H[28;52H   [1;8H[28;62H1,10-8[1;8H[?25h[?25l[28;52H~@k[1;8H[28;52H   [1;8H[?25h[?25l[28;52H~@k[1;8H[28;52H   [1;8H[?25h[?25l[28;52H~@k[1;8H[28;52H   [1;8H[?25h[?25l[28;52H~@k[1;8H[28;52H   [1;8H[?25h[?25l[28;52H~@k[1;8H[28;52H   [2;7H[28;62H2,8-7 [2;7H[?25h[?25l[28;52H~@k[2;7H[28;52H   [3;1H[28;62H3,0-1[3;1H[?25h[?25l[28;52H~@k[3;1H[28;52H   [3;1H[28;1H[1m-- 끼워넣기 --[m[28;62H[K[28;62H3,1[8C꼭대기[3;1H[?25h[?25l[28;62H4[4;1H[?25h[?25l[28;62H5[5;1H[?25h[?25l[28;62H6[6;1H[?25h[?25l[28;62H7[7;1H[?25h[?25l[28;62H8[8;1H[?25h[?25l[28;62H9[9;1H[?25h[?25l[28;62H10,1[10;1H[?25h[?25l
[46m{[24;1H}[m[28;63H1[11;1H[?25h[?25l{[24;1H}[28;63H2[12;1H[?25h[?25l[28;63H3[13;1H[?25h[?25l[28;63H4[14;1H[?25h[?25l[28;63H5[15;1H[?25h[?25l[28;63H6[16;1H[?25h[?25l[28;63H7[17;1H[?25h[?25l[28;63H8[18;1H[?25h[?25l[28;63H9[19;1H[?25h[?25l[28;62H20[20;1H[?25h[?25l[28;63H1[21;1H[?25h[?25l[28;63H2[22;1H[?25h[?25l[1;27r[27;1H
[1;28r[27;9H[38;5;121mint[m per = [95m0[m;[28;62H[K[28;62H23,1[10C14%[22;1H[?25h[?25l[1;27r[27;1H
[1;28r[28;62H[K[28;62H24,1[10C28%[9;1H[46m{[22;1H}[?25h[?25l[1;27r[m[27;1H
[1;28r[27;9Hprintf([95m"[m[38;5;224m%d[m[95m ... [m[38;5;224m\n[m[95m"[m, cur);[28;62H[K[28;62H25,1[10C42%[8;1H{[21;1H}
[?25h[?25l[1;27r[27;1H
[1;28r[27;9Hper = cur / MAX * [95m100[m;[28;62H[K[28;62H26,1[10C57%[22;1H[?25h[?25l[1;27r[27;1H
[1;28r[28;62H[K[28;62H27,1[10C71%[22;1H[?25h[?25l[1;27r[27;1H
[1;28r[27;9H[93mreturn[m per;[28;62H[K[28;62H28,1[10C85%[22;1H[?25h[?25l[1;27r[27;1H
[1;28r[27;1H}[28;62H[K[28;62H29,1[9C바닥[22;1H[?25h[?25l[28;62H30[23;1H[?25h[?25l[28;63H1[24;1H[?25h[?25l[28;63H2[25;1H[?25h[?25l[28;63H3[26;1H[?25h[?25l[20;1H[46m{[27;1H}[m[28;63H4[27;1H[?25h[?25l[20;1H{[27;1H}[28;63H3[26;1H[?25h[?25l[28;63H2[25;1H[?25h[?25l[28;65H2-9[25;9H[?25h[?25l[28;63H1[24;9H[?25h[?25l[28;65H3-10[24;10H[?25h[?25l[28;65H4-11[24;11H[?25h[?25l[28;65H5-12[24;12H[?25h[?25l[28;65H6-13[24;13H[?25h[?25l[28;63H0[23;13H[?25h[?25l[28;62H29,2-9 [22;9H[?25h[?25l[28;63H8,6-13[21;13H[?25h[?25l[20;1H[46m{[27;1H}[m[28;63H7,2   [20;2H[?25h[?25l[28;65H1[20;1H[?25h[?25l{[27;1H}[28;63H6[19;1H[?25h[?25l[28;65H2[19;2H[?25h[?25l[28;65H3[19;3H[?25h[?25l[28;63H5,1[18;1H[?25h[?25l[4;1H[46m{[17;1H}[m[28;63H4,2[17;2H[?25h[?25l[4;1H{[17;1H}[28;63H3,1[16;1H[?25h[?25l[28;63H2[15;1H[?25h[?25l[28;63H1[14;1H[?25h[?25l[28;63H0[13;1H[?25h[?25l[28;62H19[12;1H[?25h[?25l[28;63H8[11;1H[?25h[?25l[28;63H7[10;1H[?25h[?25l[28;63H6[9;1H[?25h[?25l[28;63H5[8;1H[?25h[?25l[28;63H4[7;1H[?25h[?25l[28;63H3,3[6;3H[?25h[?25l[1;27r[1;1H[L[1;28r[28;62H[K[28;62H12,3[10C85%[6;3H[?25h[?25l[1;27r[1;1H[L[1;28r[1;1H[38;5;81m#define MAX [m[95m1024[m[28;62H[K[28;62H11,2[10C71%[6;1H[46m{[19;1H}[6;2H[?25h[?25l[1;27r[m[1;1H[L[1;28r[1;1H[38;5;81m#include [m[95m<unistd.h>[m[28;62H[K[28;62H10,3[10C57%[7;1H{[20;1H}[6;3H[?25h[?25l[1;27r[1;1H[L[1;28r[1;1H[38;5;81m#include [m[95m<stdio.h>[m[28;62H[K[28;62H9,1[11C42%[6;1H[?25h[?25l[1;27r[1;1H[L[1;28r[28;62H[K[28;62H8,3[11C28%[6;3H[?25h[?25l[1;27r[1;1H[L[1;28r[1;1H[96m//%가 정상적으로 출력되지 않는 코드입니다.[m[28;62H[K[28;62H7,1[11C14%[6;1H[?25h[?25l[1;27r[1;1H[L[1;28r[1;1H[96m//진행 상황을 %로 계산해서 출력하는 코드입니다.[m[28;62H[K[28;62H6,3[8C꼭대기[6;3H[?25h[?25l[28;62H5[5;3H[?25h[?25l[28;62H4[4;3H[?25h[?25l[28;62H5[5;3H[?25h[?25l[28;62H6[6;3H[?25h[?25l[28;62H7,1[7;1H[?25h[?25l[28;62H8,3[8;3H[?25h[?25l[28;62H9,1[9;1H[?25h[?25l[28;62H8,3[8;3H[?25h[?25lit eval([38;5;121mint[m cur);[8;18H[K[28;64H2[8;2H[?25h[?25lt eval([38;5;121mint[m cur);[8;17H[K[28;64H1[8;1H[?25h[?25l[7;27r[27;1H
[1;28r[27;9H[38;5;121mint[m per = [95m0[m;[28;62H[K[28;62H7,1[8C꼭대기[7;1H[?25h[?25l[8;27r[8;1H[L[1;28r[7;1H[K[8;1Ht eval([38;5;121mint[m cur);[28;62H[K[28;62H8,1[8C꼭대기[8;1H[?25h[?25l[28;64H2[8;2H[?25h[?25l eval([38;5;121mint[m cur);[8;16H[K[28;64H1[8;1H[?25h[?25ld eval([38;5;121mint[m cur);[28;64H2[8;2H[?25h[?25l[93mdo[m eval([38;5;121mint[m cur);[28;64H3[8;3H[?25h[?25ldou eval([38;5;121mint[m cur);[28;64H4[8;4H[?25h[?25lb eval([38;5;121mint[m cur);[28;64H5[8;5H[?25h[?25ll eval([38;5;121mint[m cur);[28;64H6[8;6H[?25h[?25l[38;5;121mdouble[m eval([38;5;121mint[m cur);[28;64H7[8;7H[?25h[?25l[28;62H9,1[9;1H[?25h[?25l[28;62H10,7[10;7H[?25h[?25l
[46m{[24;1H}[m[28;63H1,2[11;2H[?25h[?25l{[24;1H}[28;63H2,7[12;7H[?25h[?25l[28;63H3[13;7H[?25h[?25l[28;63H4,1[14;1H[?25h[?25l[28;63H5[15;1H[?25h[?25l[28;63H6[16;1H[?25h[?25l[28;63H7[17;1H[?25h[?25l[28;63H8[18;1H[?25h[?25l[28;63H9[19;1H[?25h[?25l[28;62H20[20;1H[?25h[?25l[28;63H1[21;1H[?25h[?25l[28;63H2[22;1H[?25h[?25l[1;27r[27;1H
[1;28r[27;9H[38;5;121mint[m per = [95m0[m;[28;62H[K[28;62H23,1[10C14%[22;1H[?25h[?25l[1;27r[27;1H
[1;28r[28;62H[K[28;62H24,2[10C28%[9;1H[46m{[22;1H}[?25h[?25l[1;27r[m[27;1H
[1;28r[27;9Hprintf([95m"[m[38;5;224m%d[m[95m ... [m[38;5;224m\n[m[95m"[m, cur);[28;62H[K[28;62H25,1[10C42%[8;1H{[21;1H}
[?25h[?25l[1;27r[27;1H
[1;28r[27;9Hper = cur / MAX * [95m100[m;[28;62H[K[28;62H26,7[10C57%[22;7H[?25h[?25l[1;27r[27;1H
[1;28r[28;62H[K[28;62H27,2[10C71%[22;2H[?25h[?25l[1;27r[27;1H
[1;28r[27;9H[93mreturn[m per;[28;62H[K[28;62H28,1[10C85%[22;1H[?25h[?25l[1;27r[27;1H
[1;28r[27;1H}[28;62H[K[28;62H29,1[9C바닥[22;1H[?25h[?25l[28;63H8[21;1H[?25h[?25l[20;1H[46m{[27;1H}[m[28;63H7,2[20;2H[?25h[?25l{[27;1H}[28;63H6,7[19;7H[?25h[?25l[28;65H6[19;6H[?25h[?25l[28;65H5[19;5H[?25h[?25l[28;65H4[19;4H[?25h[?25l[28;65H3[19;3H[?25h[?25l[28;65H4[19;4H[?25h[?25lin eval([38;5;121mint[m cur)[19;17H[K[28;65H3[19;3H[?25h[?25l eval([38;5;121mint[m cur)[19;16H[K[28;65H2[19;2H[?25h[?25l eval([38;5;121mint[m cur)[19;15H[K[28;65H1[19;1H[?25h[?25ld eval([38;5;121mint[m cur)[28;65H2[19;2H[?25h[?25l[93mdo[m eval([38;5;121mint[m cur)[28;65H3[19;3H[?25h[?25ldob eval([38;5;121mint[m cur)[28;65H4[19;4H[?25h[?25lu eval([38;5;121mint[m cur)[28;65H5[19;5H[?25h[?25le eval([38;5;121mint[m cur)[28;65H6[19;6H[?25h[?25ll eval([38;5;121mint[m cur)[28;65H7[19;7H[?25h[?25l eval([38;5;121mint[m cur)[19;20H[K[28;65H6[19;6H[?25h[?25l eval([38;5;121mint[m cur)[19;19H[K[28;65H5[19;5H[?25h[?25l eval([38;5;121mint[m cur)[19;18H[K[28;65H4[19;4H[?25h[?25l[93mdo[m eval([38;5;121mint[m cur)[19;17H[K[28;65H3[19;3H[?25h[?25ld eval([38;5;121mint[m cur)[19;16H[K[28;65H2[19;2H[?25h[?25l eval([38;5;121mint[m cur)[19;15H[K[28;65H1[19;1H[?25h[?25ld eval([38;5;121mint[m cur)[28;65H2[19;2H[?25h[?25l[93mdo[m eval([38;5;121mint[m cur)[28;65H3[19;3H[?25h[?25ldou eval([38;5;121mint[m cur)[28;65H4[19;4H[?25h[?25lb eval([38;5;121mint[m cur)[28;65H5[19;5H[?25h[?25ll eval([38;5;121mint[m cur)[28;65H6[19;6H[?25h[?25l[38;5;121mdouble[m eval([38;5;121mint[m cur)[28;65H7[19;7H[?25h[?25l
[46m{[27;1H}[m[28;63H7,2[20;2H[?25h[?25l{[27;1H}[28;63H8,1[21;1H[?25h[?25l[28;63H9[22;1H[?25h[?25l[28;63H8[21;1H[?25h[?25l[28;65H2-9[21;9H[?25h[?25l[28;65H3-10[21;10H[?25h[?25l[28;65H4-11[21;11H[?25h[?25l[28;65H5-12[21;12H[?25h[?25lin per = [95m0[m;[21;20H[K[28;65H4-11[21;11H[?25h[?25l per = [95m0[m;[21;19H[K[28;65H3-10[21;10H[?25h[?25l per = [95m0[m;[21;18H[K[28;65H2-9 [21;9H[?25h[?25ld per = [95m0[m;[28;65H3-10[21;10H[?25h[?25l[93mdo[m per = [95m0[m;[28;65H4-11[21;11H[?25h[?25ldou per = [95m0[m;[28;65H5-12[21;12H[?25h[?25lb per = [95m0[m;[28;65H6-13[21;13H[?25h[?25ll per = [95m0[m;[28;65H7-14[21;14H[?25h[?25l[38;5;121mdouble[m per = [95m0[m;[28;65H8-15[21;15H[?25h[?25ldoubl per = [95m0[m;[21;23H[K[28;65H7-14[21;14H[?25h[?25l[38;5;121mdouble[m per = [95m0[m;[28;65H8-15[21;15H[?25h[?25l[28;63H9,2-9 [22;9H[?25h[?25l[23;15H[46m([16C)[m[28;62H30,8-15[23;15H[?25h[?25l([16C)[28;63H1[24;15H[?25h[?25l[28;65H7-14[24;14H[?25h[?25l[28;65H8-15[24;15H[?25h[?25l(cur / MAX * [95m100[m;[28;65H9-16[24;16H[?25h[?25ldcur / MAX * [95m100[m;[28;65H10-17[24;17H[?25h[?25locur / MAX * [95m100[m;[28;66H1-18[24;18H[?25h[?25lbcur / MAX * [95m100[m;[28;66H2-19[24;19H[?25h[?25lucur / MAX * [95m100[m;[28;66H3-20[24;20H[?25h[?25lecur / MAX * [95m100[m;[28;66H4-21[24;21H[?25h[?25llcur / MAX * [95m100[m;[28;66H5-22[24;22H[?25h[?25lcur / MAX * [95m10[m[1C;[24;37H[K[28;66H4-21[24;21H[?25h[?25lcur / MAX * [95m10[m[1C;[24;36H[K[28;66H3-20[24;20H[?25h[?25lcur / MAX * [95m10[m[1C;[24;35H[K[28;66H2-19[24;19H[?25h[?25llcur / MAX * [95m100[m;[28;66H3-20[24;20H[?25h[?25lecur / MAX * [95m100[m;[28;66H4-21[24;21H[?25h[?25lcur / MAX * [95m10[m[1C;[24;36H[K[28;66H3-20[24;20H[?25h[?25lcur / MAX * [95m10[m[1C;[24;35H[K[28;66H2-19[24;19H[?25h[?25lcur / MAX * [95m10[m[1C;[24;34H[K[28;66H1-18[24;18H[?25h[?25lucur / MAX * [95m100[m;[28;66H2-19[24;19H[?25h[?25llcur / MAX * [95m100[m;[28;66H3-20[24;20H[?25h[?25lecur / MAX * [95m100[m;[28;66H4-21[24;21H[?25h[?25lcur / MAX * [95m10[m[1C;[24;36H[K[28;66H3-20[24;20H[?25h[?25lcur / MAX * [95m10[m[1C;[24;35H[K[28;66H2-19[24;19H[?25h[?25lbcur / MAX * [95m100[m;[28;66H3-20[24;20H[?25h[?25llcur / MAX * [95m100[m;[28;66H4-21[24;21H[?25h[?25lecur / MAX * [95m100[m;[28;66H5-22[24;22H[?25h[?25l[38;5;121mdouble[m)cur / MAX * [95m100[m;[24;15H[46m([6C)[m[28;66H6-23[24;23H[?25h[?25l[24;15H([6C)[28;66H7-24[24;24H[?25h[?25l[28;66H8-25[24;25H[?25h[?25l[28;66H9-26[24;26H[?25h[?25l[28;65H20-27[24;27H[?25h[?25l[28;66H1-28[24;28H[?25h[?25l( MAX * [95m100[m;[28;66H2-29[24;29H[?25h[?25l* MAX * [95m100[m;[28;66H3-30[24;30H[?25h[?25l MAX * [95m10[m[1C;[24;40H[K[28;66H2-29[24;29H[?25h[?25ld MAX * [95m100[m;[28;66H3-30[24;30H[?25h[?25l[93mdo[m MAX * [95m100[m;[28;66H4-31[24;31H[?25h[?25ldou MAX * [95m100[m;[28;66H5-32[24;32H[?25h[?25lb MAX * [95m100[m;[28;66H6-33[24;33H[?25h[?25ll MAX * [95m100[m;[28;66H7-34[24;34H[?25h[?25l[38;5;121mdouble[m MAX * [95m100[m;[28;66H8-35[24;35H[?25h[?25l) MAX * [95m100[m;[24;28H[46m([6C)[m[28;66H9-36[24;36H[?25h[?25l[24;28H([6C)[28;63H0,27-34[23;34H[?25h[?25l[24;28H[46m([6C)[m[28;63H1,29-36[24;36H[?25h[?25l[24;28H([6C)[28;63H0,27-34[23;34H[?25h[?25l[24;28H[46m([6C)[m[28;63H1,29-36[24;36H[?25h[?25l[24;28H([6C)[28;63H0,27-34[23;34H[?25h[?25l[28;62H29,2-9  [22;9H[?25h[?25l[28;63H8,17-24[21;24H[?25h[?25l[20;1H[46m{[27;1H}[m[28;63H7,2    [20;2H[?25h[?25l{[27;1H}[28;63H8,17-24[21;24H[?25h[?25l[28;63H9,2-9  [22;9H[?25h[?25l[28;62H30,27-34[23;34H[?25h[?25l[24;28H[46m([6C)[m[28;63H1,29-36[24;36H[?25h[?25l[24;28H([6C)[28;63H2,2-9  [25;9H[?25h[?25l[28;63H3,13-20[26;20H[?25h[?25l[20;1H[46m{[27;1H}[m[28;63H4,2    [27;2H[?25h[?25l[20;1H{[27;1H}[28;63H3,13-20[26;20H[?25h[?25l[28;63H2,2-9  [25;9H[?25h[?25l[24;28H[46m([6C)[m[28;63H1,29-36[24;36H[?25h[?25l[24;28H([6C)[28;63H0,27-34[23;34H[?25h[?25l[28;62H29,2-9  [22;9H[?25h[?25l[28;63H8,17-24[21;24H[?25h[?25l[20;1H[46m{[27;1H}[m[28;63H7,2    [20;2H[?25h[?25l[19;12H[46m([7C)[m
{[27;1H}[28;63H6,21[19;21H[?25h[?25l[19;12H([7C)[28;63H5,1 [18;1H[?25h[?25l[4;1H[46m{[17;1H}[m[28;63H4,2[17;2H[?25h[?25l[4;1H{[17;1H}[28;63H3,11-18[16;18H[?25h[?25l[9;9H[46m{[15;9H}[m[28;63H2,3-10 [15;10H[?25h[?25l[9;9H{[15;9H}[28;63H1,12-26[14;26H[?25h[?25l[9;9H[46m{[15;9H}[m[28;63H2,3-10 [15;10H[?25h[?25l[9;9H{[15;9H}[28;63H3,11-18[16;18H[?25h[?25l[4;1H[46m{[17;1H}[m[28;63H4,2    [17;2H[?25h[?25l[4;1H{[17;1H}[28;63H5,1[18;1H[?25h[?25l[19;12H[46m([7C)[m[28;63H6,21[19;21H[?25h[?25l[19;12H([7C)
[46m{[27;1H}[m[28;63H7,2 [20;2H[?25h[?25l{[27;1H}[28;63H8,17-24[21;24H[?25h[?25l[28;63H9,2-9  [22;9H[?25h[?25l[28;62H30,27-34[23;34H[?25h[?25l[24;28H[46m([6C)[m[28;63H1,29-36[24;36H[?25h[?25l[24;28H([6C)[28;63H2,2-9  [25;9H[?25h[?25l[28;63H3,13-20[26;20H[?25h[?25l[20;1H[46m{[27;1H}[m[28;63H4,2    [27;2H[?25h[?25l:[20;1H{[27;1H}[28;65H3[27;3H[?25h[?25l[27;2H[K[20;1H[46m{[27;1H}[m[28;65H2[27;2H[?25h[?25l:[20;1H{[27;1H}[28;65H3[27;3H[?25h[?25l[27;2H[K[20;1H[46m{[27;1H}[m[28;65H2[27;2H[?25h[28;1H[K[27;1H[?25l[28;52H^[[27;1H[28;52H  [27;2H[28;62H34,1[9C바닥[27;1H[?25h[?25l[28;52H:[27;1H[28;52H[K[28;1H:[?2004h[?25hw[?25l[?25hq[?25l[?25h[?25l[?2004l"gdb_hw1.c" [도스] 34L, 564C 저장 했습니다
[?2004l[?1l>[?25h[?1049l[23;0;0t금  5월 1510:12:26jaeho $vim gdb_hw1.cls[Kgdb hw1cc -g -o hw1 gdb_hw1.c[10Pvim[C[C[C[C[C[C[C[C[C[C[10@gcc -g -o hw1[C[C[C[C[C[C[C[C[C[C[10Pvim[C[C[C[C[C[C[C[C[C[C[10@gcc -g -o hw1[C[C[C[C[C[C[C[C[C[C[10Pvim[C[C[C[C[C[C[C[C[C[C[10@gcc -g -o hw1[C[C[C[C[C[C[C[C[C[C
금  5월 1510:16:27jaeho $gcc -g -o hw1 gdb_hw1.c[10Pvim[C[C[C[C[C[C[C[C[C[Cls[Kgdb hw1cc -g -o hw1 gdb_hw1.cdb hw1[K
GNU gdb (Ubuntu 8.1-0ubuntu3.2) 8.1.0.20180409-git
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hw1...done.
(gdb) r
Starting program: /home/jaeho/gdb_hw/hw1 
0 ... 
0:1024 | 0%
30 ... 
30:1024 | 2%
60 ... 
60:1024 | 5%
90 ... 
90:1024 | 8%
120 ... 
120:1024 | 11%
150 ... 
150:1024 | 14%
180 ... 
180:1024 | 17%
210 ... 
210:1024 | 20%
240 ... 
240:1024 | 23%
270 ... 
270:1024 | 26%
300 ... 
300:1024 | 29%
330 ... 
330:1024 | 32%
360 ... 
360:1024 | 35%
390 ... 
390:1024 | 38%
420 ... 
420:1024 | 41%
450 ... 
450:1024 | 43%
480 ... 
480:1024 | 46%
510 ... 
510:1024 | 49%
540 ... 
540:1024 | 52%
570 ... 
570:1024 | 55%
600 ... 
600:1024 | 58%
630 ... 
630:1024 | 61%
660 ... 
660:1024 | 64%
690 ... 
690:1024 | 67%
720 ... 
720:1024 | 70%
750 ... 
750:1024 | 73%
780 ... 
780:1024 | 76%
810 ... 
810:1024 | 79%
840 ... 
840:1024 | 82%
870 ... 
870:1024 | 84%
900 ... 
900:1024 | 87%
930 ... 
930:1024 | 90%
960 ... 
960:1024 | 93%
990 ... 
990:1024 | 96%
1020 ... 
1020:1024 | 99%
[Inferior 1 (process 10024) exited normally]
(gdb) r[Kr[Kquit
금  5월 1510:20:36jaeho $exit[K[K[K[Keix[K[K[Keixt[K[K[Kxit
exit

Script done on 2020-05-15 10:20:51+0900
